# GetPathCurveIndexByCurveReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..GetPathCurveIndexByCurveReference Method
Form Class See Also
---
Given a reference to certain curve in the path, return its index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int GetPathCurveIndexByCurveReference(
	Reference curveReference
)
```

Visual Basic
---
```text
Public Function GetPathCurveIndexByCurveReference ( _
	curveReference As Reference _
) As Integer
```

Visual C++
---
```text
public:
int GetPathCurveIndexByCurveReference(
	Reference^ curveReference
)
```

# ### Parameters
curveReference
    Type: Autodesk.Revit.DB..::..ReferenceReference to the curve in path
# See Also
Form Class
Autodesk.Revit.DB Namespace